Revit 2026 API

# MetallicpaintTopcoatType Enumeration

---

The enumerated type representing the permitted values for the asset property "MetallicpaintTopcoat" from the "MetallicPaint" schema.

**Namespace:** Autodesk.Revit.DB.Visual**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public enum MetallicpaintTopcoatType
```
```vb
Public Enumeration MetallicpaintTopcoatType
```
```cpp
public enum class MetallicpaintTopcoatType
```
```fsharp
type MetallicpaintTopcoatType
```

| Member name | Value | Description |
| --- | --- | --- |
| Carpaint | 0 |  |
| Chrome | 1 |  |
| Custom | 3 |  |
| Matte | 2 |  |

#### Reference

Autodesk.Revit.DB.Visual Namespace